[
  {"id":"10.1145/2844110","abstract":"A view from computational journalism.","author":[{"family":"Diakopoulos","given":"Nicholas"}],"citation-key":"10.1145/2844110","container-title":"Communications of The Acm","container-title-short":"Commun. ACM","DOI":"10.1145/2844110","event-place":"New York, NY, USA","ISSN":"0001-0782","issue":"2","issued":{"date-parts":[["2016",1]]},"number-of-pages":"7","page":"56–62","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","title":"Accountability in algorithmic decision making","type":"article-journal","URL":"https://doi.org/10.1145/2844110","volume":"59"},
  {"id":"10.1145/3172944.3172961","abstract":"Intelligent systems, which are on their way to becoming mainstream in everyday products, make recommendations and decisions for users based on complex computations. Researchers and policy makers increasingly raise concerns regarding the lack of transparency and comprehensibility of these computations from the user perspective. Our aim is to advance existing UI guidelines for more transparency in complex real-world design scenarios involving multiple stakeholders. To this end, we contribute a stage-based participatory process for designing transparent interfaces incorporating perspectives of users, designers, and providers, which we developed and validated with a commercial intelligent fitness coach. With our work, we hope to provide guidance to practitioners and to pave the way for a pragmatic approach to transparency in intelligent systems.","author":[{"family":"Eiband","given":"Malin"},{"family":"Schneider","given":"Hanna"},{"family":"Bilandzic","given":"Mark"},{"family":"Fazekas-Con","given":"Julian"},{"family":"Haug","given":"Mareike"},{"family":"Hussmann","given":"Heinrich"}],"citation-key":"10.1145/3172944.3172961","collection-title":"Iui '18","container-title":"Proceedings of the 23rd international conference on intelligent user interfaces","DOI":"10.1145/3172944.3172961","event-place":"Tokyo, Japan","ISBN":"978-1-4503-4945-1","issued":{"date-parts":[["2018"]]},"number-of-pages":"13","page":"211–223","publisher":"Association for Computing Machinery","publisher-place":"Tokyo, Japan","title":"Bringing transparency design into practice","type":"paper-conference","URL":"https://doi.org/10.1145/3172944.3172961"},
  {"id":"selbstIntuitiveAppealExplainable2018","accessed":{"date-parts":[["2025",10,17]]},"author":[{"family":"Selbst","given":"Andrew D."},{"family":"Barocas","given":"Solon"}],"citation-key":"selbstIntuitiveAppealExplainable2018","container-title":"SSRN Electronic Journal","container-title-short":"SSRN Journal","DOI":"10.2139/ssrn.3126971","ISSN":"1556-5068","issued":{"date-parts":[["2018"]]},"language":"en","source":"DOI.org (Crossref)","title":"The Intuitive Appeal of Explainable Machines","type":"article-journal","URL":"https://www.ssrn.com/abstract=3126971"},
  {"id":"wieringaWhatAccountWhen2020","abstract":"As research on algorithms and their impact proliferates, so do calls for scrutiny/accountability of algorithms. A systematic review of the work that has been done in the field of ’algorithmic accountability’ has so far been lacking. This contribution puts forth such a systematic review, following the PRISMA statement. 242 English articles from the period 2008 up to and including 2018 were collected and extracted from Web of Science and SCOPUS, using a recursive query design coupled with computational methods. The 242 articles were prioritized and ordered using affinity mapping, resulting in 93 ’core articles’ which are presented in this contribution. The recursive search strategy made it possible to look beyond the term ’algorithmic accountability’. That is, the query also included terms closely connected to the theme (e.g. ethics and AI, regulation of algorithms). This approach allows for a perspective not just from critical algorithm studies, but an interdisciplinary overview drawing on material from data studies to law, and from computer science to governance studies. To structure the material, Bovens’s widely accepted definition of accountability serves as a focal point. The material is analyzed on the five points Bovens identified as integral to accountability: its arguments on (1) the actor, (2) the forum, (3) the relationship between the two, (3) the content and criteria of the account, and finally (5) the consequences which may result from the account. The review makes three contributions. First, an integration of accountability theory in the algorithmic accountability discussion. Second, a cross-sectoral overview of the that same discussion viewed in light of accountability theory which pays extra attention to accountability risks in algorithmic systems. Lastly, it provides a definition of algorithmic accountability based on accountability theory and algorithmic accountability literature.","accessed":{"date-parts":[["2025",10,17]]},"author":[{"family":"Wieringa","given":"Maranke"}],"citation-key":"wieringaWhatAccountWhen2020","container-title":"Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency","DOI":"10.1145/3351095.3372833","event-place":"Barcelona Spain","event-title":"FAT* '20: Conference on Fairness, Accountability, and Transparency","ISBN":"978-1-4503-6936-7","issued":{"date-parts":[["2020",1,27]]},"language":"en","page":"1-18","publisher":"ACM","publisher-place":"Barcelona Spain","source":"DOI.org (Crossref)","title":"What to account for when accounting for algorithms: a systematic literature review on algorithmic accountability","title-short":"What to account for when accounting for algorithms","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3351095.3372833"}
]
